helm
heml-projectile
magit
git-timemachine
undo-tree
zenburn-theme
powerline
auctex
bm
markdown-mode
sx
erlang
irfc
w3m
dsvn
dockerfile-mode
whitespace
automargin
flyspell-lazy
flyspell-popup
textile-mode
avy
on-screen
beacon
which-key
scala-mode2
ensime
ace-window
alchemist
smtpmail-multi
auto-complete
bbdb
gmail2bbdb
edts
darkroom
